In [2]:
# HOME WORK


hw_inventory = {
    "Potato": {"price": 10, "Qty": 2, "Unit": 'kg'},
    "Onion": {"price": 20, "Qty": 3000, "Unit": 'g'},
    "Lettuce": {"price": 30, "Qty": 50, "Unit": 'kg'},
    "Rawa": {"price": 10, "Qty": 500, "Unit": 'g'}
    }

In [3]:
hw_menu = {
    "Pizza": {
            "ingredients": ("Tomato", "Onion"),
            "quantities": (300, 2),
            "units": ("g", "kg")
        },
    "Burger": {
            "ingredients": ("Lettuce", "Onion"),
            "quantities": (300, 2),
            "units": ("g", "kg")
        },
    "Pani puri":{
            "ingredients": ("Potato", "Rawa"),
            "quantities": (300, 2),
            "units": ("g", "kg")
        },
    }

In [4]:
menu_item = "Pizza"

In [5]:
if hw_inventory["Potato"]["Qty"] >= hw_menu["Pani puri"]["quantities"][0]: # qty = grams
    print("Potato is enough")
else:
    print("Potato is not available enough")

if hw_inventory["Onion"]["Qty"] * 1000 >= hw_menu["Pizza"]["quantities"][1]: # converting kg to grams
    print("Onion is enough for Pizza")
else:
    print("Onion is not available enough for Pizza")

Potato is not available enough
Onion is enough for Pizza

In [6]:
if hw_inventory["Lettuce"]["Qty"]>= hw_menu ["Burger"]["quantities"][0]: #qty=gram
    print("Lettuce is available Enough")
else:
    print("lettuce ia not available ")
if hw_inventory["Onion"]["Qty"]>= hw_menu["Burger"]["quantities"][1]: #qty=gram
    print("onion is available Enough")
else:
    print("onion is not available,""burger is not doable"
    )

lettuce ia not available
onion is available Enough

In [7]:
if hw_inventory["Potato"]["Qty"] >= hw_menu ["Pani puri"]["quantities"][0]:
    print("Potato is available Enough")
if hw_inventory["Potato"]["Qty"] <= hw_menu ["Pani puri"]["quantities"][0]:
    print("potato is not available Enough")
if hw_inventory["Rawa"]["Qty"] >= hw_menu ["Pani puri"]["quantities"][1]:
    print("Rawa is available Enough", "pani puri is doable")
if hw_inventory["Rawa"]["Qty"] <= hw_menu ["Pani puri"]["quantities"][1]:
    print("rawa is not available Enough")

potato is not available Enough
Rawa is available Enough pani puri is doable

In [8]:
input_string = "This is a test string to test the capability of student"
resulting =  "This a test string to test the capability of student"

In [9]:
output = input_string.replace(" is", "")
print(output)

This a test string to test the capability of student

In [10]:
input_ = "Test for the whole class"
output = "Test for the entire class"
input_string = "This is a test string to test the capability of student"
words_replace = " is"
replacement =""

A=input_string.find(words_replace)
B=A + len(words_replace)
output = input_string[:A]+ replacement + input_string[B:]
print(output)

This a test string to test the capability of student

In [11]:
import numpy as np

In [12]:
empty_list = []

In [13]:
for i in range(300000):
    empty_list.append(i)

In [14]:
empty_array = np.array([])

In [15]:
for i in range(300000):
    np.append(empty_array, i)

In [16]:
milan = np.arange(10, 20+1)
np.average(milan)

15.0

In [17]:
import pandas as pd

In [18]:
df = pd.read_csv("tested.csv")
print(df)

     PassengerId  Survived  Pclass  \
0            892         0       3
1            893         1       3
2            894         0       2
3            895         0       3
4            896         1       3
..           ...       ...     ...
413         1305         0       3
414         1306         1       1
415         1307         0       3
416         1308         0       3
417         1309         0       3

                                             Name     Sex   Age  SibSp  Parch  \
0                                Kelly, Mr. James    male  34.5      0      0
1                Wilkes, Mrs. James (Ellen Needs)  female  47.0      1      0
2                       Myles, Mr. Thomas Francis    male  62.0      0      0
3                                Wirz, Mr. Albert    male  27.0      0      0
4    Hirvonen, Mrs. Alexander (Helga E Lindqvist)  female  22.0      1      1
..                                            ...     ...   ...    ...    ...
413                            Spector, Mr. Woolf    male   NaN      0      0
414                  Oliva y Ocana, Dona. Fermina  female  39.0      0      0
415                  Saether, Mr. Simon Sivertsen    male  38.5      0      0
416                           Ware, Mr. Frederick    male   NaN      0      0
417                      Peter, Master. Michael J    male   NaN      1      1

                 Ticket      Fare Cabin Embarked
0                330911    7.8292   NaN        Q
1                363272    7.0000   NaN        S
2                240276    9.6875   NaN        Q
3                315154    8.6625   NaN        S
4               3101298   12.2875   NaN        S
..                  ...       ...   ...      ...
413           A.5. 3236    8.0500   NaN        S
414            PC 17758  108.9000  C105        C
415  SOTON/O.Q. 3101262    7.2500   NaN        S
416              359309    8.0500   NaN        S
417                2668   22.3583   NaN        C

[418 rows x 12 columns]

In [19]:
df.sort_values('PassengerId', ascending=False)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
417,1309,0,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C
416,1308,0,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S
415,1307,0,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
414,1306,1,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C
413,1305,0,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
4,896,1,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S
3,895,0,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
2,894,0,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
0,892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q

In [20]:
index = pd.Series(["A","B","C"])
columns = pd.Series(['Test 1', 'Test 2', "Test 3"])
values = np.array([[1, 2, 6], [3, 4, 7], [5, 6, 8]])

In [21]:
data = pd.DataFrame(values, index=index, columns=columns)
data

   Test 1  Test 2  Test 3
A       1       2       6
B       3       4       7
C       5       6       8

In [22]:
df = pd.read_csv("job_placement (1).csv")

In [23]:
df.head()

,id,name,gender,age,degree,stream,college_name,placement_status,salary,gpa,years_of_experience
0,1,John Doe,Male,25,Bachelor's,Computer Science,Harvard University,Placed,60000,3.7,2.0
1,2,Jane Smith,Female,24,Bachelor's,Electrical Engineering,Massachusetts Institute of Technology,Placed,65000,3.6,1.0
2,3,Michael Johnson,Male,26,Bachelor's,Mechanical Engineering,Stanford University,Placed,58000,3.8,3.0
3,4,Emily Davis,Female,23,Bachelor's,Information Technology,Yale University,Not Placed,0,3.5,2.0
4,5,David Brown,Male,24,Bachelor's,Computer Science,Princeton University,Placed,62000,3.9,2.0

# It is easier to get a job for a women?

In [24]:
len(df.loc[(df.gender == 'Female')&(df.placement_status == 'Not Placed')]) / len(df.loc[(df.gender=='Female')])

0.1721311475409836

In [25]:
len(df.loc[(df.gender == 'Male') & (df.placement_status == 'Not Placed')]) / len(df.loc[(df.gender == 'Male')])

0.20059880239520958

# Do males earn higher than women?

#number of men and women,

#total salary earned

In [26]:
df.loc[(df.gender == 'Female')].salary.sum() /  len(df.loc[(df.gender == 'Female')])

53401.639344262294

In [27]:
df.loc[(df.gender == 'Male')].salary.sum() /  len(df.loc[(df.gender == 'Male')])

51458.08383233533

# Which stearm earns the most?

In [28]:
df.stream.unique()
for i in df.stream.unique():
    print(i, df.loc[(df.stream == i)].salary.sum() /  len(df.loc[(df.stream == i)]))

Computer Science 48359.81308411215
Electrical Engineering 51544.642857142855
Mechanical Engineering 52180.18018018018
Information Technology 54407.89473684211
Electronics and Communication 58990.99099099099

# Which stream is the best for women?

In [29]:
women = df[df['gender']=='Female']
avg_salary_by_stream = women.groupby('stream')['salary'].mean()
best_stream = avg_salary_by_stream.idxmax()
highest_avg_salary = avg_salary_by_stream.max()

print(f"The best stream for women is : {best_stream}and the highest avg salary is : {highest_avg_salary}")

The best stream for women is : Electronics and Communicationand the highest avg salary is : 59049.01960784314

In [30]:
v = [1, 2, 73, 57, 43, 601, 206]

mean = 140.43
198.56

2,777.2464
2,737.5521
649.5435
39.2235
1,356.0864
30,303.5321
559.2864

196.0165054274767

196.0165054274767

In [31]:
mean = women.groupby('stream')['salary'].mean()
(mean - df.groupby('stream')['salary'].std()).sort_values(ascending=False)

stream
Electronics and Communication    40305.053066
Information Technology           31367.468514
Electrical Engineering           26752.727697
Mechanical Engineering           26223.305364
Computer Science                 16969.713246
Name: salary, dtype: float64

In [32]:
men = df[df['gender']=='Male']
avg_salary_by_stream = men.groupby('stream')['salary'].mean()
best_stream = avg_salary_by_stream.idxmax()
highest_avg_salary = avg_salary_by_stream.max()

print(f"The best stream for men is : {best_stream} and the highest avg salary is : {highest_avg_salary}")

The best stream for men is : Electronics and Communication and the highest avg salary is : 58333.333333333336

In [1]:
print("Hello Python")

Hello Python